Repository: efl-dev/edi
Catalog: po/*.po
Languages: it

source: Please enter a valid search term.
it: Inserire un termine di ricerca valido.

source: Search for (whole project)
it: Cerca (nell'intero progetto)

source: Please enter a term to search for within<br> the whole project.<br>
it: Inserire un termine da ricercare<br> nell'intero progetto.<br>

source: Cancel
it: Annulla

source: Search
it: Cerca

source: Please enter a valid search string.
it: Inserire una stringa di ricerca valida.

source: Please enter a valid replace string.
it: Inserire una stringa di sostituzione valida.

source: Strings cannot match.
it: Le stringe non possono essere identiche.

source: Search &amp; Replace
it: Cerca e sostituisci

source: Replace all occurences of text within <br>the whole project.<br>
it: Sostituisci tutte le occorrenze del testo<br> nell'intero progetto.<br>

source: Replace
it: Sostituisci

source: Unrecognized file type
it: Tipo di file non riconosciuto

source: To force open, select this file in the file browser, <br>and use "open as" menu options.
it: Per forzare l'apertura selezionare questo file nel<br> browser e usare la voce di menù "apri come".

source: Enter line number
it: Inserire il numero di riga

source: Go
it: Vai

source: Parameters
it: Parametri

source: Returns
it: Ritorni

source: See also
it: Vedi anche

source: No help available for this term
it: Nessun aiuto disponibile per questo termine

source: Close
it: Chiudi

source: Confirmation
it: Conferma

source: File contents have changed. Would you like to reload <br> the contents of this file?
it: Il contenuto del file è cambiato, si vuole ricaricarlo?

source: Reload
it: Ricarica

source: No, continue editing
it: No, continuo a modificarlo

source: Line:%d, Column:%d
it: Riga:%d, Colonna:%d

source: Search term
it: Termine da cercare

source: Replace term
it: Termine da sostituire

source: Reached end of file, starting from beginning
it: Fine del file raggiunta, ritorno all'inizio

source: Wrap search?
it: Ricominciare ricerca?

source: Confirmation required
it: Conferma richiesta

source: Yes
it: Sì

source: No %s binary found, please install %s.
it: Non è stato trovato nessun file binario %s, si prega di installare %s.

source: Unable to launch SCM binary
it: Impossibile lanciare il binario SCM

source: Delete
it: Cancella

source: That project directory no longer exists
it: La directory del progetto non esiste più

source: Choose a Project Folder
it: Scegliere una cartella di progetto

source: Select folder
it: Selezionare cartella

source: Parent Path
it: Percorso genitore

source: Project Name
it: Nome del progetto

source: Project URL
it: URL del progetto

source: Creator Name
it: Nome del creatore

source: Creator Email
it: Email del creatore

source: Create
it: Crea

source: Create New Project
it: Crea nuovo progetto

source: Choose
it: Scegli

source: Select Project Type
it: Selezionare il tipo di progetto

source: Unable to clone project, please check URL or try again later
it: Impossibile clonare progetto, controllare l'URL o riprovare più tardi

source: Source Control URL
it: URL di controllo del sorgente

source: Checkout
it: Controlla

source: Checkout Existing Project
it: Controlla progetti esistenti

source: Welcome to Edi
it: Benvenuti in Edi

source: Recent Projects
it: Progetti recenti

source: Open Existing Project
it: Apri progetto esistente

source: Choose Project
it: Scegli progetto

source: Please enter a file name.
it: Inserire il nome del file

source: Unable to write file.
it: Impossibile scrivere file

source: Please enter a directory name.
it: Inserire il nome della directory

source: Please enter a valid name.
it: Si prega di inserire un nome valido.

source: Directory with that name already exists.
it: Esiste già una directory con lo stesso nome.

source: File with that name already exists.
it: Esiste già un file con lo stesso nome.

source: Rename directory
it: Rinomina directory

source: Rename file
it: Rinomina file

source: Please enter a new name for this directory.
it: Inserire un nuovo nome per questa directory.

source: Please enter a new name for this file.
it: Inserire un nuovo nome per questo file.

source: Rename
it: Rinomina

source: Enter new file name
it: Inserire nome del nuovo file

source: Please enter a name for this new file.
it: Inserire un nome per questo nuovo file.

source: Enter new directory name
it: Inserire nome della nuova directory

source: Please enter a name for this new directory.
it: Inserire un nome per questa nuova directory.

source: Color theme
it: Tema colore

source: Translucent
it: Trasparente

source: Hide Toolbar
it: Nascondi barra strumenti

source: Display whitespace
it: Mostra spazi vuoti

source: Line width marker
it: Marcatore larghezza riga

source: Tabstop
it: Tabulazione

source: Builds
it: Compila

source: Runtime binary
it: Binario runtime

source: Select
it: Seleziona

source: Runtime arguments
it: Argomenti runtime

source: Default debugger
it: Debugger predefinito

source: Project Settings
it: Impostazioni progetto

source: Author Name
it: Nome autore

source: Author E-mail
it: Email autore

source: Source Control
it: Controllo sorgente

source: Remote URL
it: URL remota

source: Behaviour
it: Comportamento

source: Auto save files
it: Salvataggio automatico file

source: Trim trailing whitespace
it: Elimina spazi vuoti in coda

source: Edi Settings
it: Impostazioni di Edi

source: Project
it: Progetto

source: Global
it: Globale

source: About Edi %s
it: A proposito di Edi %s

source: <br>EDI is an IDE designed to get people into coding for Unix.<br>It's based on the <b>EFL</b> and written completely natively<br>to provide a <i>responsive</i> and <i>beautiful</i> UI.<br>
it: <br>EDI è un IDE progettato per introdurre alla programmazione su Unix.<br>È basato sulle <b>EFL</b> e scritto del tutto nativamente<br>per fornire una interfaccia <i>responsiva</i> e <i>bella</i>.<br>

source: <hilight>EDI's lovely authors</hilight>
it: <hilight>Gli amabili autori di EDI</hilight>

source: Visit Website
it: Visita sito web

source: Report Issue
it: Riporta problemi

source: Help Translate
it: Aiuta nella traduzione

source: Donate Now
it: Dona adesso

source: C header
it: Intestazione C

source: C source
it: Sorgente C

source: Python source
it: Sorgente Python

source: Rust source
it: Sorgente Rust

source: Are you sure you want to delete <hilight>%s</hilight> ?
it: Sicuro di viler cancellare <hilight>%s</hilight>?

source: Open
it: Apri

source: Open in New Window
it: Apri in una nuova finestra

source: Open in New Panel
it: Apri in un nuovo pannello

source: Open as
it: Apri come

source: Open External
it: Apri esterno

source: Stage Changes
it: Esegui stage dei cambiamenti

source: Unstage Changes
it: Rimuovi stage dei cambiamenti

source: Rename File
it: Rinomina file

source: Delete File
it: Elimina file

source: Create File here
it: Crea file qui

source: Create Directory here
it: Crea directory qui

source: Open Terminal here
it: Apri terminale qui

source: Rename Directory
it: Rinomina directory

source: Remove Directory
it: Elimina directory

source: Staged changes
it: Cambiamenti in stage

source: Unstaged changes
it: Cambiamenti non in stage

source: Untracked changes
it: Cambiamenti non tracciati

source: Find file
it: Trova file

source: Project created at path %s
it: Progetto creato nel percorso %s

source: Unable to create project at path %s
it: Impossibile creare progetto nel percorso %s

source: Building "%s" target [%s] using [%s].
it: Compilazione obbiettivo "%s" [%s] usando [%s].

source: Target [%s] not supported for builder [%s].
it: Obbiettivo [%s] non supportato dal compilatore [%s].

source: create requires 6 additional parameters:
it: crea richiede 6 parametri aggiuntivi:

source: Cowardly refusing to build unknown project type.
it: Codardamento mi rifiuto di compilare un progetto di tipo sconosciuto.

source: Unrecognized build type - try build, clean, create or test.
it: Tipo di compilazione sconosciuta - provare compila, pulisci, crea o test.

source: File path required
it: Richiesto percorso del file

source: Please choose a file from the list.
it: Scegliere un file dall'elenco.

source: Logs
it: Log

source: Tests
it: Test

source: Tasks
it: Task

source: Unable to launch
it: Impossibile lanciare

source: No launch binary found, please configure in Settings.
it: Binario di lancio non trovato, si prega di configurarlo nelle impostazioni.

source: Unable to launch debugger
it: Impossibile lanciare il debugger

source: No debug binary found, please check system configuration and Settings.
it: Binario di debugging non trovato, controllare configurazione e impostazioni di sistema.

source: Missing user information
it: Informazioni utente mancanti

source: No user information found, please configure in Settings.
it: Nessuna informazione dell'utente trovata, si prega di configurarle nelle impostazioni.

source: Cowardly refusing to build unknown project type.
it: Codardamente mi rifiuto di compilare un progetto di tipo sconosciuto.

source: %s of project <b>%s</b> in %s failed with status code %d.
it: %s del progetto <b>%s</b> in %s fallita con codice di stato %d.

source: %s of project <b>%s</b> in %s was successful.
it: %s del progetto <b>%s</b> in %s riuscita.

source: Failed
it: Fallito

source: Passed
it: Riuscito

source: Build
it: Compila

source: Clean
it: Pulisci

source: Are you sure you wish to stash these changes?
it: Sicuri di voler accantonare questi cambiamenti?

source: New Project
it: Nuovo progetto

source: New
it: Nuovo

source: New Directory
it: Nuova directory

source: Save
it: Salva

source: Close all
it: Chiudi tutto

source: Settings
it: Impostazioni

source: Quit
it: Esci

source: Edit
it: Modifica

source: Undo
it: Annulla

source: Redo
it: Ripeti

source: Cut
it: Copia

source: Copy
it: Taglia

source: Paste
it: Incolla

source: Find & Replace
it: Trova e sostituisci

source: Goto Line
it: Vai alla riga

source: Find in project
it: Trova nel progetto

source: Replace in project
it: Sostituisci nel progetto

source: View
it: Visualizza

source: New Window
it: Nuova finestra

source: New Panel
it: Nuovo pannello

source: Split View
it: Visualizzazione divisa

source: Open Tasks
it: Task aperti

source: Run
it: Esegui

source: Memcheck
it: Controllo memoria

source: Init
it: Inizializza

source: Commit
it: Prepara aggiornamenti

source: Stash
it: Accantona

source: Status
it: Stato

source: Push
it: Carica aggornamenti

source: Pull
it: Scarica aggiornamenti

source: Help
it: Aiuto

source: About
it: A proposito

source: New File
it: Nuovo file

source: Find
it: Trova

source: Project path must be a directory
it: Il percorso del progetto dev'essere una directory

source: Could not open file of unsupported mime type (%s)
it: Impossibile aprire file di tipo mime non supportato (%s)

source: Please enter a valid commit message.
it: Inserire un messaggio descrittivo valido

source: User information
it: Informazioni utente

source: Unable to obtain user information.
it: Impossibile ottenere informazioni utente

source: Author
it: Autore

source: Show unstaged changes
it: Mostra cambiamenti non in stage

source: File changes
it: Cambiamenti file

source: Commit message
it: Descrizione aggiornamento

source: Enter commit summary<br><br>And change details<br>
it: Inserire sommario e<br><br>dettagli aggiornamento<br>

source: Source changes
it: Cambiamenti del sorgente

source: Total pass %d (%d%%), fail %d)
it: Totale riusciti %d (%d%%), falliti %d)
